import React, { Component } from 'react';
import './platform-news-text.css';
import { Container, Col, Row, Card, CardBody } from 'reactstrap';
import { NavLink as RRNavLink, Link } from 'react-router-dom';

const Breadcrumb = React.lazy(() =>
  import('../../../views/Pages/components/breadcrumb/breadcrumb')
);

class DecisionDraft extends Component {
  render() {
    return (
      <React.Fragment>
        <Breadcrumb title="اخبار المنصة" link="/client/platform-news" />
        <section>
          <Container>
            <Row>
              <Col xs="12" className="plat-news">
                <Card>
                  <CardBody>
                    <div className="header">
                      <h5>ثلاثة رواد اعمال يحصلون علي لابلاب لا</h5>
                      <span className="sub-header">
                        <i className="fa fa-calendar"></i>
                        25/8/2019
                      </span>
                    </div>
                    <p className="bg-font">
                      لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج
                      أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات
                      دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس
                      نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس
                      أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن
                      ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو
                      فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات
                      كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا
                      ديسيريونتموليت انيم أيدي ايست لابوريوم. دولاريمكيو
                      لايودانتيوم,توتام ريم أبيرأم,أيكيو أبسا كيواي أب أللو
                      أنفينتوري فيرأتاتيس ايت كياسي أرشيتيكتو بيتاي فيتاي ديكاتا
                      سيونت أكسبليكابو. نيمو أنيم أبسام فوليوباتاتيم كيواي
                      فوليوبتاس سايت أسبيرناتشر أيوت أودايت أيوت فيوجايت, سيد
                      كيواي كونسيكيونتشر ماجناي دولارس أيوس كيواي راتاشن
                      فوليوبتاتيم سيكيواي نيسكايونت. نيكيو بوررو كيوايسكيوم
                      ايست,كيواي دولوريم ايبسيوم كيوا دولار سايت أميت,
                      كونسيكتيتيور,أديبايسكاي فيلايت, سيد كيواي نون نيومكيوام
                      ايايوس موداي تيمبورا انكايديونت يوت لابوري أيت دولار
                      ماجنام ألايكيوام كيوايرات فوليوبتاتيم. يوت اينايم أد
                      مينيما فينيام, كيواس نوستريوم أكسيركايتاشيم يلامكوربوريس
                      سيوسكايبيت لابورايوسام, نايساي يوت ألايكيوايد أكس أيا
                      كوموداي كونسيكيواتشر؟ كيوايس أيوتيم فيل أيوم أيوري
                      ريبريهينديرايت كيواي ان إيا فوليوبتاتي فيلايت ايسسي كيوم
                      نايهايل موليستايا كونسيكيواتيو,فيلايليوم كيواي دولوريم أ
                      كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا
                      ديسيريونتموليت انيم أيدي ايست لابوريوم. دولاريمكيو
                      لايودانتيوم,توتام ريم أبيرأم,أيكيو أبسا كيواي أب أللو
                      أنفينتوري فيرأتاتيس ايت كياسي أرشيتيكتو بيتاي فيتاي ديكاتا
                      سيونت أكسبليكابو. نيمو أنيم أبسام فوليوباتاتيم كيواي
                      فوليوبتاس سايت أسبيرناتشر أيوت أودايت أيوت فيوجايت, سيد
                      كيواي كونسيكيونتشر ماجناي دولارس أيوس كيواي راتاشن
                      فوليوبتاتيم سيكيواي نيسكايونت. نيكيو بوررو كيوايسكيوم
                      ايست,كيواي دولوريم ايبسيوم كيوا دولار سايت أميت,
                      كونسيكتيتيور,أديبايسكاي فيلايت, سيد كيواي نون نيومكيوام
                      ايايوس موداي تيمبورا انكايديونت يوت لابوري أيت دولار
                      ماجنام ألايكيوام كيوايرات فوليوبتاتيم. يوت اينايم أد
                      مينيما فينيام, كيواس نوستريوم أكسيركايتاشيم يلامكوربوريس
                      سيوسكايبيت لابورايوسام, نايساي يوت ألايكيوايد أكس أيا
                      كوموداي كونسيكيواتشر؟ كيوايس أيوتيم فيل أيوم أيوري
                      ريبريهينديرايت كيواي ان إيا فوليوبتاتي فيلايت ايسسي كيوم
                      نايهايل موليستايا كونسيكيواتيو,فيلايليوم كيواي دولوريم أ
                    </p>
                    <div>
                      <Link className="sub-header"># طاقة</Link>
                      <Link className="sub-header"># طاقة</Link>
                    </div>
                  </CardBody>
                </Card>
              </Col>
            </Row>
          </Container>
        </section>
      </React.Fragment>
    );
  }
}

export default DecisionDraft;
